<template>
<div>
  <van-nav-bar class="nav" :title="$t('supply.register')" left-arrow @click-left="onClickLeft" />
  <div class="register">
    <van-cell-group>
      <p class="regemile">
        {{$t('register.emile')}}
        <span>{{$t('register.must')}}</span>
      </p>
      <van-field v-model="emile" class="reg_emile L0" clearable placeholder="例）starday@starday.com" clickable :error-message="errormsg" @input="Regemil">
        <van-button slot="button" size="small" type="primary" :disabled='disabled' @click="sendCode">{{loadtext}}</van-button>
      </van-field>
      <van-field v-model="sms" center clearable label="验证码" placeholder="请输入验证码">

      </van-field>
      <p>
        {{$t('register.pwd')}}
        <span>{{$t('register.must')}}</span>
      </p>
      <van-field v-model="password" class="reg_emile" :type="ispwd" :placeholder="$t('register.exp1')" :right-icon="tog" clickable @click-right-icon="toggle" />
      <p>
        {{$t('register.mininame')}}
        <span>{{$t('register.must')}}</span>
      </p>
      <van-field v-model="username" class="reg_emile" type="text" placeholder="例如starday123" clickable />
      <p>
        {{$t('register.name')}}
        <span>{{$t('register.must')}}</span>
      </p>
      <van-field v-model="xing" class="reg_emile_1" type="text" placeholder="姓" clickable />
      <van-field v-model="ming" class="reg_emile_1" type="text" placeholder="名" clickable />
      <p>
        {{$t('register.name')}} ({{$t('register.name2')}})
        <span>{{$t('register.must')}}</span>
      </p>
      <van-field v-model="xing1" class="reg_emile_1" type="text" placeholder="姓" clickable />
      <van-field v-model="ming1" class="reg_emile_1" type="text" placeholder="名" clickable />
      <p>
        {{$t('register.six')}}
        <span>{{$t('supply.p24')}}</span>
      </p>
      <van-radio-group v-model="radio">
        <van-radio name="1" class="sixn" checked-color="#EC581E">{{$t('register.man')}}</van-radio>
        <van-radio name="2" class="sixn" checked-color="#EC581E">{{$t('register.men')}}</van-radio>
      </van-radio-group>
    </van-cell-group>
    <p class="datepick">
      {{$t('register.birthday')}}
      <span>{{$t('supply.p24')}}</span>
      <van-field v-model="brithday" class="reg_emile" clickable @click="showPopup" />
    </p>

    <van-popup v-model="dateshow">
      <van-datetime-picker v-model="currentDate" type="date" :min-date="minDate" @confirm='confirm' :formatter='formatter' /></van-popup>


    <van-checkbox v-model="check" checked-color="#EC581E" class="agree" @click="popup">{{$t('register.agree')}}</van-checkbox>
    <van-button class="button" type="warning" :disabled="!check" size="large" @click="gologin">{{$t('register.gologin')}}</van-button>
    <van-popup v-model="show">
      目录
      <br />利用規約 2
      <br />STARDAY 利用規約 2
      <br />共通サービス利用規約 2
      <br />第1章 総則 3
      <br />第1条 本規約の範囲及び変更 3
      <br />第2条 本サービスの利用 3
      <br />第2章利用者 4
      <br />第3条 利用者 4
      <br />第３章 会員 4
      <br />第4条 会員 4
      <br />第5条 会員登録 4
      <br />第6条 登録内容の変更 6
      <br />第7条 本サービスの利用停止及び会員登録の取消 6
      <br />第8条 退会手続 7
      <br />第9条 メールアドレス及びパスワードの管理 7
      <br />第10条 個人情報の利用 8
      <br />第4章 サービスの利用 8
      <br />第11条 提供するサービス 8
      <br />第12条 免責事項 8
      <br />第13条 禁止事項 10
      <br />第14条 知的財産権 11
      <br />第5章 サービスの運用 12
      <br />第15条 情報の管理 12
      <br />第16条 本サービスの保守 12
      <br />第17条 その他 13
      <br />STARDAY サービス利用規約 13
      <br />第1章 総則 14
      <br />第1条 本規約の範囲及び変更 14
      <br />第2条 本サービスの利用 14
      <br />第3条 提供するサービス 15
      <br />第２章 会員 15
      <br />第4条 会員 15
      <br />第5条 会員登録 15
      <br />第6条 登録内容の変更 17
      <br />第7条 本サービスの利用停止及び会員登録の取消 17
      <br />第8条 退会手続 18
      <br />第3章 商品の購入 19
      <br />第9条 商品の購入 19
      <br />第10条 支払方法 19
      <br />第11条 商品等の返品・交換・注文の撤回及び取消し 20
      <br />第12条 商品等に関する免責 23
      <br />STARDAY 利用規約
      <br />1.三益貿易株式会社（以下、「当社」といいます。）は、各サービスである「STARDAY」（以下、単に「STARDAY 」といいます。）、今後当社が新しく開始するサービス（以下、個別に「各サービス」といいます。）及び共通サービスの利用規約（以下、「本規約」といいます。）を以下の通り定めます。
      <br />2. 各サービスを利用される場合は、各サービスに関する利用規約のみが適用となりますので、その場合は当社が別途定める各サービスに関する利用規約にそれぞれ従うものとします。
      <br />共通サービス利用規約
      <br />第1章 総則
      <br />
      <br />第1条 本規約の範囲及び変更
      <br />1. 本規約は、当社が運営するウェブサイトに共通するサービス（以下、「本サービス」といいます。）の利用に関する規約を定めたものです。
      <br />2. 本規約は、本サービスの利用に関して、利用者（第3条で定義します。）全てに適用されるものとします。但し、本サービス以外の当社が提供する各サービスに関して、各サービスに関する利用規約にのみ定めのある規定、又は関連する項目で本規約と各サービスに関する利用規約との間で重複する規定がある場合には、各サービスに関する利用規約の規定のみが適用されます。
      <br />3. 当社は、利用者の事前の承諾を得ることなく、サイト上での掲載又はメール等の当社が適当と判断する方法で利用者に告知又は通知することにより、適宜、本規約の全部又は一部を変更できるものとします。
      <br />4. 本規約の全部又は一部が変更された場合、本サービスの利用に関しては、変更後の規約が適用されるものとし、利用者は変更後の規約のみに従うものとします。
      <br />第2条 本サービスの利用
      <br />利用者は、法令、規則、通達並びに本規約及び当社が別途定める個人情報保護方針、プライバシーポリシー、HELP等に従い、本サービスを利用するものとします。
      <br />第2章利用者
      <br />第3条 利用者
      <br />本規約において「利用者」とは、本規約の内容を全て了解・承認した上で、当社が本サービスで提供する画像、テキスト、デザイン、ロゴ、映像、プログラム、アイディア、情報等（以下、本規約において「コンテンツ」と総称します。）を検索、閲覧又は利用する者（会員（＜共通サービス利用規約＞第4条で定義します。）を含みます。）を総称します。
      <br />第３章 会員
      <br />第4条 会員
      <br />本規約において「会員」とは、本規約の内容を全て了解・承認した上で、当社所定の手続に従い会員登録を申請し、当社がこれを承認した者、並びに会員登録をおこなわずに、商品購入のたびに当社が別途指定する必要事項を入力し、当社がこれを承認した者を総称します。
      <br />第5条 会員登録
      <br />1. 会員登録の希望者は、本サービスの会員登録ページから、当社が別途指定する方法に従い、性別、生年月日、郵便番号、メールアドレス、パスワード、また当社を通じて商品又はサービス（以下、「商品等」と総称します。）を購入する際には、住所、氏名、電話番号を設定・入力の上、会員登録申請を行うものとします。
      <br />2. 当社は、第1項に基づく申請に対し、パソコン、タブレット端末並びにスマートフォンからの会員登録の場合、会員登録ボタンを押した時点で会員登録を承認するものとします。
      <br />3. 当社は、以下の各号の何れかに該当する場合、当該登録を承認しないものとします。
      <br />(1) 会員登録の希望者が、過去に当社の提供する何らかのサービスに関する規約（本規約及びサイト上に明記した各サービスに関連する他社の規約を含みますが、これらに限りません。）に違反したこと等により、会員登録の抹消等の処分を受けていたことが判明した場合
      <br />(2) 会員登録の希望者の申請内容に虚偽の事項が含まれていることが判明した場合
      <br />(3) 会員登録の希望者が、過去に当社の提供する何らかのサービス（サイト上に明記した各サービスに関連する他社のサービスを含みますが、これらに限りません。）に関して、料金等（商品等の購入代金を含みますが、これに限りません。以下同様とします。）の支払を履行していない場合（当社が別途認める支払方法に関連する第三者に対して料金等の支払を履行していない場合を含みますが、これに限りません。）、又は、正当な理由なく長期間に亘る商品等の受取り不能、返品・交換の拒絶その他の債務不履行があったことが判明した場合
      <br />(4) 過去に本規約第14条（禁止事項）の行為を行ったことが判明した場合
      <br />(5) その他登録を承認することが本サービスの運営・管理上、不適当であると当社が合理的に判断する場合
      <br />第6条 登録内容の変更
      <br />1. 会員は、当社に登録している事項の全部又は一部に変更が生じた場合には、当社が別途指定する方法により、すみやかに登録内容を変更するものとします。
      <br />2. 当社は、利用者が適宜、変更登録を行わなかったことにより何らかの損害が生じたとしても、一切責任を負わないものとします。
      <br />第7条 本サービスの利用停止及び会員登録の取消
      <br />当社は、会員が以下の各号の何れかに該当する場合、事前に通知することなく、当該会員に対して本サービスの利用停止、会員登録抹消その他当社が適当と考える措置を講ずることができるものとします。
      <br />(1) 過去に当社の提供する何らかのサービスに関する規約に違反をしたこと等により、会員登録の抹消等の処分を受けていたことが判明した場合
      <br />(2) 登録された内容に虚偽の事項が含まれていることが判明した場合
      <br />(3) 過去又は現在において、当社の提供する何らかのサービスに関して、料金等の支払を履行していない場合（当社が別途認める支払方法に関連する第三者に対して料金等の支払を履行していない場合を含みますが、これに限りません。）、又は、正当な理由なく長期間に亘る商品等の受取り不能、返品・交換の拒絶その他の債務不履行 があったことが判明した場合
      <br />(4) 過去に本規約第14条（禁止事項）の行為を行ったことが判明した場合
      <br />(5) その他当社が定める何らかの規約（本規約を含みますが、これに限りません。）の規定に違反した場合
      <br />第8条 退会手続
      <br />会員は、当社所定の手続を経て、いつでも退会することができるものとします。会員は、当社が会員からの退会申請を受領した時点で会員資格を喪失するものとします。
      <br />第9条 メールアドレス及びパスワードの管理
      <br />1. 会員は、会員登録等の際に会員自身で設定したユーザーID及びパスワードを厳重に管理・保管する責任を負うものとします。
      <br />2. 会員は、当社の事前の同意がある場合を除き、ユーザーID及びパスワードを第三者に譲渡、売買、承継、貸与、開示又は漏洩してはならないものとします。
      <br />3. 会員は、ユーザーID又はパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに当社に連絡するものとし、当社の指示がある場合はそれに従うものとします。
      <br />4. 会員は、ユーザーID又はパスワードの管理不十分、使用上の過誤・不手際、第三者の無断使用等に起因する損害につき自ら責任を負うものとし、当社は一切責任を負担しないものとします。
      <br />第10条 個人情報の利用
      <br />本サービスの利用に関連して当社が知り得た会員の個人情報については、当社は別途当社が定める「個人情報保護方針」に従い取り扱うものとします。
      <br />第4章 サービスの利用
      <br />第11条 提供するサービス
      <br />当社は、本サービスの一部として次のサービスを提供します。
      <br />(1) 会員がマイページ（第12条で定義します。）を利用すること
      <br />(2) 各サービスの情報を閲覧すること
      <br />(3) 各サービスからのリンク先を閲覧すること
      <br />第12条 免責事項
      <br />1. 本サービスから他のウェブサイト若しくはリソースへのリンク、又は第三者のウェブサイト若しくはリソースから本サービスへのリンクを提供している場合、当社は、当該リンク先の内容、利用及びその結果（適法性、有効性、正確性、確実性、安全性、最新性及び完全性を含みますが、これらに限られません。）については、いかなる責任も負わないものとします。なお、当社は、リンク先のウェブサイト又はリソースの内容が、違法又は本サービスの管理・運営上不適切であると合理的に判断した場合には、会員に何らの通知を要することなく、当該リンク先を削除することができるものとします。
      <br />2. 本サービス中に広告（懸賞広告を含みますが、これに限りません。）又は宣伝を行っている広告主との取引（懸賞等のプロモーションへの参加を含みますが、これに限りません。）がある場合、利用者は、自らの判断と責任により、当該広告主との間で取引を行うものであり、これに関して当社は一切責任を負わないものとします。商品等の代金の支払、契約条件の決定、保証、担保責任、ライセンスの有無等の取引に関する内容・条件は、一切、当社が保証するものではなく、当社は、本サービス中に掲載されている広告又は宣伝を経由して行われる取引に起因して、会員に何らかの損害については一切責任を負わないものとします。
      <br />3. 当社は、以下の場合に、一時的に本サービスが停止、中止又は変更されたとしても、会員が直接的又は間接的に被った一切の損害、損失、不利益等について、いかなる責任も負わないものとします。
      <br />(1) 火災、地震、洪水、落雷、大雪等の天変地異が生じた場合
      <br />(2）戦争、内乱、テロ、暴動、騒乱等の社会不安が生じた場合
      <br />(3) 当社が契約している電話会社、運送会社又はプロバイダから適切なサービスを受けられなかった場合
      <br />(4) 当社が技術的に対応不可能な事由が生じた場合
      <br />4. 当社は、会員の登録内容に従い事務を処理することにより、当社の債務を履行し免責されるものとします。
      <br />5. 会員が、本サービスを利用することにより、他の利用者又は第三者に対して何らかの損害等を与えた場合には、当該会員はその責任と費用においてこれを解決し、当社には一切の損害、損失、不利益等を与えないものとします。
      <br />第13条 禁止事項
      <br />利用者は、以下の行為を一切行ってはならないものとします。万一、これに違反して当社又は第三者に損害が生じた場合、当該利用者がその損害を全て賠償する責任を負うものとします。
      <br />(1) 他の利用者、他の利用者以外の第三者、若しくは当社に迷惑、不利益若しくは損害を与える行為、又はそれらのおそれのある行為
      <br />(2)他の利用者、他の利用者以外の第三者、若しくは当社の著作権等の知的財産権、肖像権、人格権、プライバシー権、パブリシティ権その他の権利を侵害する行為又はそれらのおそれのある行為
      <br />(3) 本サービスを商業目的で利用する行為（但し、当社が予め認めたものは除きます。）
      <br />(4) 公序良俗に反する行為その他法令に違反する行為又はそれらのおそれのある行為
      <br />(5) 虚偽又は誤解を招くような内容を含む情報を登録する行為
      <br />(6)本サービスを通じて入手したコンテンツを利用者が私的使用の範囲外で使用する行為
      <br />(7)他の利用者、又は他の利用者以外の第三者を介して、本サービスを通じて入手したコンテンツを複製、販売、出版、頒布、公開及びこれらに類似する行為
      <br />(8)他の利用者の個人情報を収集、蓄積又は保存をする行為
      <br />(9)コンピューターのソフトウェア、ハードウェア、通信機器の機能を妨害、破壊、制限するように設計されたコンピューターウィルス、コンピューターコード、ファイル、プログラム等のコンテンツを本サービスにアップロードしたり、メール等の手段で送信したりする行為
      <br />(10) 過度に商品を返品する行為
      <br />(11) その他当社の信用を毀損・失墜させる等の当社が不適当であると合理的に判断する行為
      <br />第14条 知的財産権
      <br />1. 本サービスを通じて提供されるコンテンツの知的財産権は、全て当社に専属的に帰属するものとします。
      <br />2. 目的の如何を問わず、当社のコンテンツの無断複製、無断転載その他の無断二次利用行為等の国内及び国外の著作権法及びその他の法令により禁止される行為が発見された場合には、当社は直ちに法的措置をとるものとします。
      <br />3. 本条の規定に違反して第三者との間で何らかの紛争が生じた場合、会員はその責任と費用において、かかる紛争を解決するとともに、当社に何らの損害、損失又は不利益等を与えないものとします。
      <br />第5章 サービスの運用
      <br />第15条 情報の管理
      <br />当社は、その裁量により、当社及び当社と提携するサイトにおいて、本サービスに関連して利用者が発信したコンテンツの全部又は一部を自由に利用できるものとします。当該コンテンツを利用するにあたり、当社は投稿者に対して一切の支払を必要としないものとします。
      <br />第16条 本サービスの保守
      <br />当社は、本サービスの稼動状態を良好に保つため、以下各号の何れかの場合には、 利用者に事前に通知を行うことなく、一時的に本サービスの提供の全部又は一部を停止又は中止することができるものとします。 (1) 本サービス提供のためのコンピューターシステム（以下、「システム」といいます。）の定期保守及び緊急保守の場合
      <br />(2) 火災、地震、洪水、落雷、大雪等の天変地異により、システムの運用が困難になった場合
      <br />(3) 戦争、内乱、テロ、暴動、騒擾等の社会不安により、システムの運用が困難になった場合
      <br />(4) システムの不良及び第三者からの不正アクセス、コンピューターウィルスの感染等により、システムの運用が困難になった場合
      <br />(5) 行政機関・司法機関から相当な根拠に基づき要請された場合
      <br />(6) その他やむを得ずシステムの停止又は中止が必要と当社が判断した場合
      <br />第17条 その他
      <br />本サービスの利用に関して、本規約又は当社の指導・対応により解決できない問題が生じた場合には、当社と利用者との間で双方誠意をもって話し合い、これを解決するものとします。
      <br />STARDAY サービス利用規約
      <br />第1章 総則
      <br />第1条 本規約の範囲及び変更
      <br />1. この規約（以下、「本規約」といいます。）は、当社が運営するアプリ「STARDAY」に関するサービス（以下、「本サービス」といいます。）の利用に関し、当社及び会員（第3条で定義します。）に適用されるものとします。
      <br />2. 当社は、会員の事前の承諾を得ることなく、アプリ上での掲載又はメール等の当社が適当と判断する方法で会員に告知又は通知することにより、適宜、本規約の全部又は一部を変更できるものとします。
      <br />3. 本規約の全部又は一部が変更された場合、本サービスの利用に関しては、変更後の規約のみが適用されるものとし、会員は変更後の規約のみに従うものとします。
      <br />第2条 本サービスの利用
      <br />1. 会員は、法令、条例、規則、通達並びに共通サービス利用規約、本規約及び当社が別途定める個人情報保護方針、キャンセル・返品・交換規約、HELP等のルールに従い、本サービスを利用するものとします。
      <br />2. 未成年の会員は、適格な法定代理人の事前の同意を得なければ、本サービスを利用することができません
      <br />。
      <br />第3条 提供するサービス
      <br />利用者は、本サービスにおいて次の行為を行うことができます。
      <br />(1) 会員は、当社所定の方法に従い、本サービスを利用して当社から商品等を購入することができます
      <br />第２章 会員
      <br />第4条 会員
      <br />本規約において「会員」とは、当社が別途定める＜共通サービス利用規約＞「第4条 会員」の規定が適用されるものとします。
      <br />第5条 会員登録
      <br />本規約において「会員」とは、当社が別途定める＜共通サービス利用規約＞「第4条 会員」の規定が適用されるものとします。
      <br />1. 会員登録をする際には、＜共通サービス利用規約＞「第5条 会員登録」に定めた会員登録に必要な項目を入力・設定した上で、登録申請することを前提条件とします。
      <br />2. 未成年者は、適格な法定代理人の事前の同意がなければ、会員登録申請をすることができないものとします。
      <br />3. 当社は、以下の各号の何れかに該当する場合、当該登録を承認しない場合があります。
      <br />(1)会員登録の希望者が過去に当社の提供する何らかのサービスに関する規約（本規約及びサイト上に明記した各サービスに関連する他社の規約を含みますが、これらに限りません。）に違反したこと等により、会員登録の抹消等の処分を受けていたことが判明した場合
      <br />(2)会員登録の希望者の申請内容に虚偽の事項が含まれていることが判明した場合
      <br />(3)過去に当社の提供する何らかのサービス（サイト上に明記した各サービスに関連する他社のサービスを含みますが、これらに限りません。）に関して、料金等の支払を履行していない場合（当社が別途認める支払方法に関連する第三者に対して料金等の支払を履行していない場合を含みますが、これに限りません。）、又は、正当な理由なく長期間に亘る商品又はサービス（以下、「商品等」と総称します。）の受取り不能、返品・交換の拒絶その他の債務不履行があったことが判明した場合
      <br />(4)過去に＜共通サービス利用規約＞「第14条 禁止事項」の行為を行ったことが判明した場合
      <br />(5) その他登録を承認することが本サービスの運営・管理上、不適当であると当社が合理的に判断する場合
      <br />第6条 登録内容の変更
      <br />1. 会員は、氏名、住所、電話番号その他当社に登録している事項の全部又は一部に変更が生じた場合には、当社が別途指定する方法により、すみやかに登録内容を変更するものとします。
      <br />2. 当社は、会員が適宜、変更登録を行わなかったことにより何らかの損害が生じたとしても、一切責任を負わないものとします。
      <br />第7条 本サービスの利用停止及び会員登録の取消
      <br />当社は、会員が以下の各号の何れかに該当する場合、事前通知することなく、当該会員に対して本サービスの利用停止、会員登録抹消その他当社が適当と考える措置を講ずることができるものとします。
      <br />(1)過去に当社の提供する何らかのサービスに関する規約（本規約及びサイト上に明記した各サービスに関連する他社の規約を含みますが、これらに限りません。）に違反をしたこと等により、会員登録の抹消等の処分を受けていたことが判明した場合
      <br />(2)登録された内容に虚偽の事項が含まれていることが判明した場合
      <br />(3)過去又は現在において、当社の提供する何らかのサービス（サイト上に明記した各サービスに関連する他社のサービスを含みますが、これらに限りません。）に関して、料金等の支払を履行していない場合（当社が別途認める支払方法に関連する第三者に対して料金等の支払を履行していない場合を含みますが、これに限りません。）、又は、正当な理由なく長期間に亘る商品等の受取り不能、返品・交換の拒絶その他の債務不履行があったことが判明した場合
      <br />(4)＜共通サービス利用規約＞「第14条禁止事項」の行為を行ったことが判明した場合
      <br />(5)その他当社の定める何らかの規約（本規約及びサイト上に明記した各サービスに関連する他社の規約を含みますが、これらに限りません。）に違反した場合
      <br />第8条 退会手続
      <br />退会を希望する場合は、別途定める＜共通サービス利用規約＞「第8条 退会手続」の規定が適用されるものとします。
      <br />第3章 商品の購入
      <br />第9条 商品の購入
      <br />1. 会員は、商品等の購入を希望する場合、当社が別途指定する方法に従って、商品等の購入又は利用を申込むものとします。
      <br />2. 前項の申込みに伴い、会員が入力・登録した配達先・注文内容等を確認の上で注文する旨のボタンをクリックし、その後、当社から注文内容を確認する旨のメールが会員に到達した時点で、会員と当社との間に当該商品等に関する売買契約が成立するものとします。
      <br />3. 前項の規定に拘わらず、本サービス利用に関して不正行為又は不適当な行為があった場合、当社は売買契約について取消、解除その他の適切な措置を取ることができるものとします。
      <br />4. 本サービスによる商品等の配送は、日本国内に限ります。
      <br />第10条 支払方法
      <br />1. 商品等の支払い金額は、消費税を含む商品等の購入代金及びこれに係わる取り扱い手数料の合計となります。
      <br />2. 本サービスによって購入された商品等の支払いに関しては、会員本人名義のクレジットカードによる支払、又は当社が別途認める支払方法に限るものとします。
      <br />3. クレジットカードで支払われる場合は、会員がクレジットカード会社との間で別途契約する条件に従うものとします。なお、クレジットカードの利用に関連して、会員とクレジットカード会社等の間で何らかの紛争が発生した場合は、会員とクレジットカード会社との間で責任をもって解決するものとします。
      <br />第11条 商品等の返品・交換・注文の撤回及び取消し
      <br />1.商品の返品については、以下の場合に限り受け付けるものとします。
      <br />(1)ご注文内容と異なる商品が到着した場合
      <br />(2)配送中に破損した商品の場合
      <br />(3)上記（1）から（2）のいずれにも該当せず、商品到着後30日以内であって、かつ以下のいずれにも該当しない場合。但し、販売ページ上に「返品対象外」の記載がある商品については返品することができません。 ①使用済み、お直しや洗濯、クリーニングがされた場合
      <br />②納品書を紛失した場合
      <br />③商品タグ・ラベルを切り離し、紛失した場合
      <br />④返送時の商品（箱、商品の付属品を含みますが、これらに限りません。）の状態がお届け時と比べて毀損、汚損、紛失等している場合
      <br />⑤お客様のもとで商品に臭いが付着したり、汚れ、キズが生じた場合
      <br />⑥パッケージが商品の一部となっている商品において、パッケージを開封した場合
      <br />⑦下着・水着等・化粧品等の衛生商品、福袋・福箱・セール商品（中古商品でのセールも含みます。）・アウトレット商品・予約商品である場合
      <br />2.会員は、当社が別途定める手順に従い前項に定める返品を申請するものとし、前項（1）から（3）については返送にかかる費用は当社が負担し、会員が購入した時点の販売価格、配送料、代引き手数料及びコンビニ決済手数料、ならびに返品対象商品の購入に際して使用したSTARDAY ポイントもしくは提携サイト発行ポイントを返還するか、又は代品に交換します。なお、代品への交換を希望された場合においても、商品の欠品等を理由に交換ができないことがあります。また、前項（3）については返送にかかる費用は会員が負担し、当社は会員が購入した時点の販売価格、配送料及び代引き手数料及びコンビニ決済手数料、ならびに返品対象商品の購入に際して使用したSTARDAY
      ポイントまたは提携サイト発行ポイントを返還します。
      <br />3. 会員は、商品の返品を行った場合、当該商品及び会員が返品対象商品の購入に際して取得したSTARDAY ポイント又は提携サイト発行ポイントを当社に返還するものとし、当社と会員間で相互に返還すべきポイントの処理方法は、対等数をもって相殺する方法により行うものとします。この場合、当社が返還すべきポイント数が、会員が返還すべきポイント数を上回るときは、当該相殺後の残数のポイントを会員に返還するものとし、会員が返還すべきポイント数が、当社が返還すべきポイント数を上回るときは、当該相殺後の残数に相当する額（返品対象商品の購入時点における1ポイントあたりの金額で算定した額）を、当社が会員に返金すべき返品対象商品の購入代金から控除する方法で行うものとします。
      <br />4.ご注文の撤回及び取消しについては、予約/受注商品（但し、福袋を除く）については注文確定から24時間以内、セール商品については注文確定後から当社における配送準備中までの期間に限り受け付けるものとします。商品の発送処理後から商品到着までの間は、当社の責めに帰すべき事由がある場合を除き、商品のご注文の撤回および取消しをすることができません（商品到着後の返品については、本条第１項の定めるとおりとします）。
      <br />5.当社は、会員が正当な理由なく商品を当社に返送した場合（第1項に定める事由に該当しない商品の返品、受領拒否、受領不可等を含みますがこれらに限りません。）、当該商品を受領した後、遅滞なく会員に対し通知し、相当の期間を定めたうえで当該商品の受け取りにつき会員に対して指図をもとめるものとします。
      <br />6.当社は、相当の期間内に前項に規定する会員からの指図がない場合、会員に対し予告した上で、その予告をした日から起算して1年間当該商品を保管するものとします。なお、当社は、当該保管期間内に会員より商品の受け取りに関する指図を受けた場合、当該商品について現状有姿で引渡すものであり、当該商品の状態（商品の変質、変形、消耗、毀損又は腐敗等を含みますがこれらに限りません。）について一切責任を負わないものとします。
      <br />7.当社は、前項の保管期間経過後、当該商品の保管期間が終了した旨を会員に対して通知するものとし、当該通知日から起算して7日以内に会員より当該商品の受け取りに関する指図がない場合、廃棄その他当社の定める処分方法により当該商品を処分するものとします。この場合当社は会員に対して一切の責任を負わないものとします。
      <br />第12条 商品等に関する免責
      <br />1.当社は、本サービス及び本サービスを通じて販売される商品等につき、その品質、材質、機能、性能、他の商品との適合性その他の欠陥、又はこれらが原因となり生じた損害、損失、不利益等については、前条に定める場合を除き、いかなる保証・負担も負わないものとします。
      <br />2.当社は、配送先不明等によるトラブルに関しては、会員が登録している連絡先に連絡すること及び商品購入の際に指定された配達先に商品等を配送等することにより、商品等の引渡債務を履行し、当該債務から免責されるものとします。
      <br />3.当社は、STARDAYのトップページ及び販売ページ上において、Twitter等のSNSサービスの利用会員が投稿した商品に関するコメントの内容について、当該コメントの内容が事実に反するものであったとしても、これによる商品を購入した会員に生じた損害に対しては、当社に故意又は重過失がある場合を除き、一切の責任を負わないものとします。
      <br />付則：本規約は2019年6月20日から全ての会員に適用されるものとします。
      <br />
      <br />
      <br />
      <br />
      <br />
      <br />STARDAY個人情報保護方針
      <br />三益貿易株式会社本方針を採用し個人情報を共同利用する会社（こちらの会社は以下「当社」といいます。）は、インターネットショッピングサイトをはじめとした様々なサービス事業（以下「サービス」といいます。）を提供しています。
      <br />当社は、サービスをご利用になるお客様をはじめとして、当社に個人情報をご提供される全ての方々の個人情報の重要性を認識しております。
      <br />個人情報保護に関する法令およびその他の規範を遵守し、自主的なルールおよび体制を確立し、次の事項を含む個人情報保護方針を定め、これを実施し、かつ、維持することを宣言いたします。
      <br />第１条 取得する個人情報の項目
      <br />当社は、法に基づき、下記の個人情報を取得いたします。
      <br />（1） サービスへのログインおよび利用等に関する情報
      <br />・ サービスログインのためのアカウントのIDおよびパスワード
      <br />・ アカウント登録情報としての性別、生年月日、郵便番号およびメールアドレス
      <br />・ アカウントに紐づく情報としてお客様から提供される、氏名、住所、電話番号、SNSアカウント情報、身長、身体的特徴その他のお客様に関する情報
      <br />・ ポイント、クーポン、キャッシュバックその他のサービスの利用に関する情報
      <br />・ サービスの利用を通じてお客様が行った取引の遂行のための情報および当該取引内容に関する情報
      <br />・ クレジットカード情報、銀行口座情報、電子マネー、収納代行、代引きに関する情報その他の決済およびその方法に関する情報
      <br />・ お客様から当社へのお問い合わせやご連絡等に関する情報
      <br />・ 法律上の要請等により、本人確認を行うための本人確認書類（運転免許証、健康保険証、住民票の写し等のことをいいます。）および当該書類に含まれる情報
      <br />（2） 従業員等に係る情報
      <br />・ 従業員（派遣職員、アルバイトを含みます。）の氏名、住所、来歴その他の従業員に係る情報
      <br />・ 当社の取引先等の個人に係る情報
      <br />（3） 第三者から取得する情報
      <br />・ お客様の同意を得て第三者から取得する情報
      <br />・ 法令に基づき取得する情報
      <br />・ 公開されていることにより取得する情報
      <br />当社が取得するお客様の情報は、全てお客様の意思によってご提供いただくものです。なお、サービスの利用に関連して当社が取得する情報の全部又は一部をご提供いただけない場合は、サービスの利用をお断りする場合がございますので、あらかじめご了承下さい。
      <br />第２条 個人情報の利用目的
      <br />当社は、第１条に記載した個人情報を、法に基づき、下記のとおり利用いたします。
      <br />（1） サービスへのログインおよびサービスの利用（お客様の同意に基づく利用またはお客様との契約の履行のための利用）
      <br />・ お客様がサービスにログインするため
      <br />・ お客様に適したサービスを提供・運用するため
      <br />・ お客様と当社との間の取引の成立および履行その他のお客様によるサービスの利用のため
      <br />・ サービスの会員であるお客様の管理のため
      <br />・ サービスの商品等の梱包・発送業務のため
      <br />・ サービスの対価の請求のため
      <br />・ ポイントサービスの運用のため
      <br />・ サービスの運営上必要な事項の通知のため
      <br />・ サービスの各種問合わせ、アフターサービス対応のため
      <br />・ 退会したお客様へのご連絡・各種問合わせ対応のため
      <br />・ 不正行為等の防止および対応のため
      <br />・ 当社が実施するサービス又は企画に関する連絡のため
      <br />・ ユーザーの本人認証及び各種画面における登録情報の自動表示
      <br />なお、お客様がサービスへログインし、サービスをご利用いただくためには、当社が上記の目的で利用するために、お客様の個人情報をご提供いただく必要がございます。
      <br />（2） 広告・マーケティングのための利用（お客様の同意に基づく利用）
      <br />・ サービス上または第三者の媒体においてサービスの勧誘、広告その他のマーケティングをするため
      <br />・ メールマガジンの送信のため
      <br />・ ダイレクトメールの送付のため
      <br />・ キャンペーン、懸賞企画、アンケートの実施のため
      <br />・ サービス上または第三者の媒体において第三者が広告主となる広告を配信するため
      <br />（3） 商品開発・研究のための利用（お客様との同意に基づく利用）
      <br />・ マーケティングデータの調査・分析のため
      <br />・ 当社の新たなサービスや商品等の開発のため
      <br />（4） 従業員等管理のための利用（契約の履行又は法令上の義務を果たすための利用）
      <br />・ 採用・労務・退職者その他の当社の労務管理のため
      <br />・取引先情報の管理のため
      <br />第３条 個人情報の提供の同意
      <br />当社は、法令で認められる場合またはお客様の同意をいただいた場合には第三者に対して個人情報を提供いたします。以下の場合においては、当社は第三者に対して、必要な範囲で個人情報（第１号および第２号並びに第４号にあっては，氏名や住所など直接特定の個人を識別することができる情報を除外した情報）を提供させていただきます。
      <br />（1） サービスの提供または品質向上に必要な場合
      <br />（2） 新たなサービスの検討・開発のために必要な場合
      <br />（3） 外国にある第三者に個人情報の取り扱いを委託する場合
      <br />（4） 大学その他の学術研究を目的とする機関若しくは団体又はそれらに属する者に学術研究の用に供する目的で個人情報を提供する場合
      <br /> なお、当社は、お客様へのサービスの提供等のため必要がある場合には、委託先に対する必要かつ適切な監督を行った上で、個人情報の取り扱いを第三者に委託することがあります。
      <br />第4条 本「個人情報保護方針」の変更
      <br />個人情報を適切に利用し、その保護を徹底するために本「個人情報保護方針」の全部または一部を改定することがあります。重要な変更がある場合は、適用開始日をお知らせしたうえで通知を行います。
      <br />第5条 個人情報の取扱いに関するご相談・苦情等について
      <br />当社の個人情報の取扱いに関するご相談や苦情、異議等のお問い合わせについては、下記の窓口までご連絡いただきますよう、お願い申し上げます。また、お客様のご同意はいつでも撤回することが可能です。
      <br />--------------------------------------------------------------------------------------------------
      <br />［個人情報についてのお問い合わせ先］
      <br />三益貿易株式会社 個人情報のお問い合わせ担当
      <br />E-mail：csc-1@starday.shop
      <br />受付時間：10:00～16:00（土日祝を除く）
      <br />※お問い合わせは上記の営業時間でお願い致します。
      <br />ご注文は定休日でも２４時間受け付けております。
    </van-popup>
  </div>
</div>
</template>
<script src='./indes.ts'>


</script>
<style lang="scss" scoped>
@import './index.scss';
</style>